title: Invocation of Wireshark Hacktool (wireshark.exe)
id: 2afafd61-6aae-4df4-baed-139fa1f4c345
status: test
description: Detects process_creation of wireshark, detecting complete domain compromise.
references:
    - 
author: John Thruntman
date: 2019/01/16
modified: 2022/03/11
tags:
    - attack.credential_access
    - attack.t1040
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wireshark.exe'
    condition: selection
falsepositives:
    - None, this is the perfect rule.
level: High